In [1]:
import numpy as np
import pandas as pd

In [11]:
df = pd.DataFrame([[4,9],[6,7]],columns = ['A','B'])
df

   A  B
0  4  9
1  6  7

In [4]:
df.apply(np.sum,axis = 1)

0    13
1    13
dtype: int64

In [5]:
#手动实现apply
results = [0]*len(df)
results

[0, 0]

In [7]:
for i,v in df.iterrows():
    results[i] = v.sum()
df['sum'] = results
df

   A  B  sum
0  4  9   13
1  6  7   13

In [8]:
df.sum(axis = 1)

0    26
1    26
dtype: int64

In [10]:
df['sum'] = df.sum(axis = 1)
df

   A  B  sum
0  4  9   13
1  6  7   13

In [25]:
df = pd.read_clipboard()
df

    A  B  C
0 NaN  5  6
1 NaN  4  8
2 NaN  1  5

In [22]:
def replace_missing(series):
    if np.isnan(series['A']):
        series['A'] = max(series['B'],series['C'])
    return series
df1 = df.apply(replace_missing,axis = 1)
df1

     A    B    C
0  6.0  5.0  6.0
1  8.0  4.0  8.0
2  5.0  1.0  5.0

In [28]:
df['A'].where(~df['A'].isna(),df[['B','C']].max(axis = 1),inplace = True)
df

     A  B  C
0  6.0  5  6
1  8.0  4  8
2  5.0  1  5

In [27]:
df

    A  B  C
0 NaN  5  6
1 NaN  4  8
2 NaN  1  5

In [46]:
data = pd.DataFrame({'fruit':['orange','lemon','mango'],'order':["I'd like an orange","Mango please","May I have a mango"]})
data

    fruit               order
0  orange  I'd like an orange
1   lemon        Mango please
2   mango  May I have a mango

In [32]:
mask = [fruit.lower() in order.lower() for (fruit,order) in data[['fruit','order']].values]
data1 = data[mask]
data1

    fruit               order
0  orange  I'd like an orange
2   mango  May I have a mango

In [43]:
def test_fruit_in_order(series):
    if series["fruit"].lower() in series["order"].lower():
        return series
    return np.nan

In [47]:
data.apply(test_fruit_in_order,axis=1).dropna()   #,result_type="reduce",

    fruit               order
0  orange  I'd like an orange
2   mango  May I have a mango

In [48]:
data.apply(test_fruit_in_order,axis=1)

    fruit               order
0  orange  I'd like an orange
1     NaN                 NaN
2   mango  May I have a mango